Revit 2026 API

# ViewDisplayModel Properties

---

The ViewDisplayModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnableSilhouettes | True to show silhouettes edges. False to disable showing them. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowHiddenLines | True to enable hidden lines. False to disable showing them. |
|  | SilhouetteEdgesGStyleId | Style ID for silhouette edges |
|  | SmoothEdges | True to enable "smooth edge" (anti-aliasing) effect. False to disable it. |
|  | Transparency | The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent |

#### Reference

ViewDisplayModel Class

Autodesk.Revit.DB Namespace